src/DataProcessors/СозданиеЧековКоррекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СозданиеЧековКоррекции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеXMLКорректируемогоЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассирИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Comment>Может быть только "Комиссионер"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СНОКорректируемогоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекСкорректированный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекСкорректированныйПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекСторно</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекСторноПроведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПозицииЧека</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПоставщикаТелефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПредметаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАгентаПоПредметуРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакПредметаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСпособаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОснований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аванс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ЧекКоррекции</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторФискальнойЗаписи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолнаяПостоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипыРасчетаДенежнымиСредствами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаДенежнымиСредствами</Name>
			<Comment>Типы расчета денежными средствами для кассового чека</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредств</Name>
					<Comment>Чек продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредств</Name>
					<Comment>Чек возврата продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходДенежныхСредств</Name>
					<Comment>Чек покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРасходаДенежныхСредств</Name>
					<Comment>Чек возврата покупки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/СозданиеЧековКоррекции/Forms/Форма_/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Неопределено;
	
	Параметры.Свойство("ДокументОснование", Основание);
	Если Основание = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Возможен только ввод на основании. Самостоятельное открытие формы не предусмотрено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Результат") Тогда
		ЗаполнитьНаОсновании(Параметры.Результат);
	Иначе 
		ТекстСообщения = НСтр("ru = 'Возможен только ввод на основании. Самостоятельное открытие формы не предусмотрено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИспользуетсяКомиссионнаяТорговля = Ложь;
	// Если ЗначениеЗаполнено(Объект.Организация) Тогда
	//		ИспользуетсяКомиссионнаяТорговля = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Организация, "ПриемАгентскихПлатежей")
	//				Или Объект.ПозицииЧека.НайтиСтроки(Новый Структура("ПризнакАгентаПоПредметуРасчета", "Комиссионер")).Количество() > 0;
	// КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЧекаКоррекции"
		И (Источник = Объект.ЧекСторно
		ИЛИ Источник = Объект.ЧекСкорректированный) Тогда
		
		Статус = НСтр("ru = 'Записан, не пробит'");
		
		Если Параметр.ПробитЧек Тогда
			Статус = НСтр("ru = 'Проведен и пробит'");
		ИначеЕсли Параметр.Проведен Тогда
			Статус = НСтр("ru = 'Проведен, но не пробит'");
		КонецЕсли;
		
		Если Источник = Объект.ЧекСторно Тогда
			ЧекСторноСтатус = Статус;
		Иначе
			ЧекСкорректированныйСтатус = Статус;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	Если Объект.СНОКорректируемогоДокумента <> Объект.СистемаНалогообложения Тогда
		
		Оповещение = Новый ОписаниеОповещения("НеСоответствиеСНОВопрос", ЭтотОбъект);
		
		ТекстСообщения = НСтр("ru = 'Выбранная система налогообложения не соответствует системе налогообложения ""%1"" корректируемого документа. Продолжить?'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.СНОКорректируемогоДокумента);
		
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения "НеСоответствиеСНОВопрос".
//
Процедура НеСоответствиеСНОВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ТипКоррекцииПриИзменении(Элемент)
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Контрагент) <> Тип("Строка") И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Объект.КонтрагентИНН = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Контрагент, "ИНН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура КомментарийПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьКартинкуДляКомментария", 0.1, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииЧека

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
		ОбновитьИтоги();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаПризнакАгентаПоПредметуРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПризнакАгентаПоПредметуРасчета) Тогда
		ТекущаяСтрока.ДанныеПоставщикаНаименование 		= "";
		ТекущаяСтрока.ДанныеПоставщикаИНН 				= "";
		ТекущаяСтрока.ДанныеПоставщикаТелефон 			= "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаЦенаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаСуммаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ПозицииЧекаСуммаСкидокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОплата

&НаКлиенте
// Процедура - обработчик события "ПриНачалеРедактирования".
//
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	СуммаПродажи = Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаОплат   = Объект.Оплата.Итог("Сумма");
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСумма  = ТекущаяСтрока.Сумма;
		ОплатаБезТекущейСтроки = СуммаОплат - ТекущаяСумма;
		ОстатокОплаты = СуммаПродажи - ОплатаБезТекущейСтроки;
	КонецЕсли;
	
	Элементы.ОплатаСумма.СписокВыбора.Очистить();
	
	Если ОстатокОплаты > 0 Тогда          		
		Элементы.ОплатаСумма.СписокВыбора.Добавить(ОстатокОплаты, Формат(ОстатокОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=; ЧГ=3,0"));		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаEmail(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаEmail", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Email", Объект.АдресЭП);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Введите адрес электронной почты (Email)'"));
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияEmail", ОтказКлиентаОтСохраненияТелефонаEmail);
	
	// Диана
	// ОбщегоНазначения.ОткрытьФормуВводаEmailОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаТелефона", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(Объект.Телефон) Тогда
		Телефон = Число(Объект.Телефон);
	Иначе
		Телефон = 0;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок" , НСтр("ru = 'Введите номер телефона'"));
	ПараметрыФормы.Вставить("ЧислоВвода", Объект.Телефон);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияТелефона", ОтказКлиентаОтСохраненияТелефонаEmail);
	
	// Диана
	// ПодключаемоеОборудованиеРТКлиент.ОткрытьФормуВводаТелефонаДляОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "СоздатьЧеки".
//
Процедура СоздатьЧеки(Команда)
	
	Если ВнесеныИзменения() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьЧекиЗавершение", ЭтотОбъект),
						НСтр("ru='Создать чеки? Будут созданы и пробиты по ККТ чек ""сторно"" и измененный чек.'"),
						РежимДиалогаВопрос.ДаНетОтмена,,
						КодВозвратаДиалога.Да,,);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Внесите изменения.
									   |Допускается корректировка:
									   |системы налогообложения, 
									   |видов оплаты,
									   |ставки НДС,
									   |признака способа и предмета расчета.'"));
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения "СоздатьЧекиЗавершение".
//
Процедура СоздатьЧекиЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		// Выполнить контроль кассовой смены
		ОписаниеОшибки					= Неопределено;
		ВыполнятьОперациюНаФискальнике  = ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Касса, "ИспользоватьБезПодключенияОборудования") = Ложь; 
		ПараметрыИспользованияКассовойСмены = Новый Структура("ВыполнятьОперациюНаФискальнике", ВыполнятьОперациюНаФискальнике);
		РозничныеПродажиКлиент.ВыполнитьКонтрольИспользованияКассовойСмены(ЭтотОбъект, Объект.Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки, Ложь);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - После контроля использования кассовой смены.
//
// Параметры:
//  ИспользованиеКассовойСменыРазрешено	 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ПослеКонтроляИспользованияКассовойСмены(ИспользованиеКассовойСменыРазрешено, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки) Экспорт 
	
	Если ИспользованиеКассовойСменыРазрешено = Ложь Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Чек коррекции'; en = 'Correction check'"),,НСтр("ru = 'Операция запрещена: '; en = 'Operation is prohibited: '") + ОписаниеОшибки, БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное); 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыИспользованияКассовойСмены.Свойство("ВыполнятьОперациюНаФискальнике") и ПараметрыИспользованияКассовойСмены.ВыполнятьОперациюНаФискальнике Тогда
		// Если КассаИспользуетсяККТ(Объект.Касса) = Истина Тогда
		//	Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		//		ПараметрыФормы = Новый Структура("Клиент, Касса", Объект.Контрагент, Объект.Касса);
		//		Оповещение = Новый ОписаниеОповещения("НапечататьЧекЗавершение", ЭтотОбъект);
		//		ОткрытьФорму("Обработка.ПомощникПроведенияОплаты.Форма.ФормаПараметровЧекаККТ", ПараметрыФормы, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//		Возврат;
		//	КонецЕсли;
		// КонецЕсли;
		
		ОбработатьСозданиеЧеков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обрабатывает создание чеков.
//
Процедура ОбработатьСозданиеЧеков() 
	
	Результат = СоздатьЧекиСервер();
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Элементы.СтраницаДанныеДляКоррекции.ТолькоПросмотр 	= Истина;
		Элементы.КомандаEmail.Доступность 					= Ложь;
		Элементы.КомандаSMS.Доступность 					= Ложь;
		Модифицированность 									= Ложь;
		
		Если ЗначениеЗаполнено(Результат.ЧекКоррекцииСторно) Тогда
			Объект.ЧекСторно 			= Результат.ЧекКоррекцииСторно;
			Объект.ЧекСторноПроведен 	= Результат.ЧекКоррекцииСторноПроведен;
			
			Если Объект.ЧекСторноПроведен Тогда
				ЧекСторноСтатус = 1;
			Иначе
				ЧекСторноСтатус = 3;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ЧекСкорректированный) Тогда
			Объект.ЧекСкорректированный			= Результат.ЧекСкорректированный;
			Объект.ЧекСкорректированныйПроведен = Результат.ЧекСкорректированныйПроведен;
			
			Если Объект.ЧекСторноПроведен Тогда
				ЧекСкорректированныйСтатус = 1;
			Иначе
				ЧекСкорректированныйСтатус = 3;
			КонецЕсли;

		КонецЕсли;
		
		// Пробиваем по принципу: сначала приход денег в кассу, потом расход
		Если Объект.ЧекСторноПроведен И Объект.ЧекСкорректированныйПроведен Тогда
			
			Если Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств")
				ИЛИ Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств") Тогда
				
				ПробитьЧекВыполнить(Объект.ЧекСкорректированный);
				
			Иначе
				
				ПробитьЧекВыполнить(Объект.ЧекСторно);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ЧекКоррекцииСторно) ИЛИ ЗначениеЗаполнено(Результат.ЧекСкорректированный) Тогда
			ОповеститьОбИзменении(Тип("ДокументСсылка.ЧекКоррекции"));
		КонецЕсли;
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.СтраницаСозданныеДокументы;
		
	КонецЕсли;
	
	УправлениеВидимостьюИДоступностью();
	
КонецПроцедуры           

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаEmail(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.Email) Тогда
			Объект.АдресЭП = РезультатОткрытияФормы.Email;
			Объект.Телефон = "";
		Иначе
			Объект.АдресЭП = "";
			Объект.Телефон = "";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаТелефона(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.ВведенноеЧисло) Тогда
			Объект.Телефон = Формат(РезультатОткрытияФормы.ВведенноеЧисло, "ЧЦ=10; ЧДЦ=; ЧГ=0");
			Объект.АдресЭП = "";
		Иначе
			Объект.Телефон = "";
			Объект.АдресЭП = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик оповещения "ПробитьЧекВыполнитьЗавершение".
//
Процедура ПробитьЧекВыполнитьЗавершение(ВыходныеПараметры) Экспорт
	
	// Если РезультатВыполнения.Результат Тогда
		
		ЗаписатьЧекКоррекцииПослеПробития(ВыходныеПараметры);
		
		// Если чек сторно пробился, то пробивается скорректированный чек
		ПробитыйДокумент = ВыходныеПараметры[8].ДокументОснование[0];
		
		Если ПробитыйДокумент = Объект.ЧекСторно
			И Не ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЧекСкорректированный, "ПробитЧек") Тогда
			
			// Если ДополнительныеПараметры.ПробиватьСледующийЧек Тогда
			
				ПробитьЧекВыполнить(Объект.ЧекСкорректированный, Ложь);
			
			// КонецЕсли;
			
		ИначеЕсли ПробитыйДокумент = Объект.ЧекСкорректированный
			И Не ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.ЧекСторно, "ПробитЧек") Тогда
			
			// Если ДополнительныеПараметры.ПробиватьСледующийЧек Тогда
			
				ПробитьЧекВыполнить(Объект.ЧекСторно, Ложь);
			
			// КонецЕсли;
			
		КонецЕсли;
		
	// Иначе
	//	ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка:'");
	//	ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
	//	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	// КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура персчитывает сумму НДС в строке.
//
Процедура ПересчитатьСуммуНДССтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(ТекущаяСтрока.ЦенаСоСкидками * ТекущаяСтрока.Количество, ТекущаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
// Процедура - управляет видимостью, доступностью.
//
Процедура УправлениеВидимостьюИДоступностью()
	
	Элементы.НомерПредписания.Видимость				= Объект.ТипКоррекции = 1;
	Элементы.ДекорацияНомерПредписания.Видимость	= Объект.ТипКоррекции = 1;

	// Элементы.ТипКоррекции.МаксимальнаяШирина = ?(Объект.ТипКоррекции = 0, 45, 20);
	
	Если Объект.ЧекСкорректированныйПроведен И Объект.ЧекСторноПроведен Тогда
		Элементы.ГруппаСкорректированнаяОбщая.Видимость = Истина;
		Элементы.ГруппаСторноОбщая.Видимость = Истина;
	Иначе
		Элементы.ГруппаСкорректированнаяОбщая.Видимость = Ложь;
		Элементы.ГруппаСторноОбщая.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура устанавливает картинку для комментария.
//
Процедура Подключаемый_УстановитьКартинкуДляКомментария()
	
	УстановитьКартинкуДляКомментария(Элементы.СтраницаКомментарий, Объект.Комментарий);
	
КонецПроцедуры

&НаКлиенте
// Процедура - устанавливает картинку для комментария.
//
Процедура УстановитьКартинкуДляКомментария(ГруппаДополнительно, Комментарий)
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ГруппаДополнительно.Картинка = БиблиотекаКартинок.Комментарий;
	Иначе
		ГруппаДополнительно.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - создает чеки на сервере.
//
Функция СоздатьЧекиСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	Иначе
		Возврат Обработки.СозданиеЧековКоррекции.СоздатьЧекиКоррекции(Объект);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - выполняет пробитие чека.
//
Процедура ПробитьЧекВыполнить(ЧекКоррекции, ПробиватьСледующийЧек = Истина)
	
	// ФормированиеЧека = ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции);
	// Если ФормированиеЧека.Результат Тогда
	//	ИдентификаторУстройства = МенеджерОборудованияСервер.ПолучитьИдентификаторФискальногоРегистратораДляКассы(Объект.КассаККМ);
	//	Если ФормированиеЧека.Свойство("ФискальныйЧек") Тогда     			
	//		ОбщиеПараметры = ФормированиеЧека.ФискальныйЧек;      
	//		ПараметрыОповещения = Новый Структура("ПробиватьСледующийЧек"			, ПробиватьСледующийЧек);
	//		Оповещение = Новый ОписаниеОповещения("ПробитьЧекВыполнитьЗавершение"	, ЭтотОбъект, ПараметрыОповещения);
	//		МенеджерОборудованияКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, УникальныйИдентификатор, ОбщиеПараметры, ИдентификаторУстройства);
	//	КонецЕсли;	
	// КонецЕсли;
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		МенеджерОборудованияКлиент.ВыбратьУстройство("ККТ", НСтр("ru = 'Выберите ККТ'"), НСтр("ru = 'ККТ не подключен'"), Новый ОписаниеОповещения("ПробитьЧекВыполнитьПослеВыбораУстройства",ЭтотОбъект, ЧекКоррекции));				
			
	Иначе
		ОписаниеОшибки      = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
		ПроизошлоИсключение = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Пробить чек выполнить после выбора устройства
//
// Параметры:
//  ИдентификаторУстройства	 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПробитьЧекВыполнитьПослеВыбораУстройства(ИдентификаторУстройства, ЧекКоррекции) Экспорт
	
	ОписаниеОшибки = "";
	
	Если НЕ ИдентификаторУстройства = Неопределено Тогда
		
		ПараметрывККТ    = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(ИдентификаторУстройства);					
		Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства, ОписаниеОшибки);
		
		Если Результат Тогда 			
			
			ОбщиеПараметры = ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции);
			
			ВходныеПараметры  = Новый Массив;
			ВходныеПараметры.Добавить(ОбщиеПараметры.ФискальныйЧек);
			ВыходныеПараметры = Новый Массив; 	
			
			Если ОбщиеПараметры.Результат Тогда 												
				// Печать фискального чека
				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства, "PrintReceipt", ВходныеПараметры, ВыходныеПараметры);
			КонецЕсли;
			
			Если Результат Тогда	
				ПробитьЧекВыполнитьЗавершение(ВыходныеПараметры);
				// ЧекКоррекции.НомерЧекаККМ        = ?(Не ЗначениеЗаполнено(ВыходныеПараметры[1]), 1, ВыходныеПараметры[1]);			
			Иначе					
				ОписаниеОшибки      = ВыходныеПараметры[1];
				ПроизошлоИсключение = Истина;							
			КонецЕсли;					
			// Отключаем ФР
			МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор, ИдентификаторУстройства);
			
		Иначе
			ТекстСтандартногоСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
			|Чек не напечатан на фискальном регистраторе.
			|Дополнительное описание:
			|%ДополнительноеОписание%'");
			ПроизошлоИсключение = Истина;
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - подготавливает данные для пробития чека.
//
Функция ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции)
	
	Возврат Документы.ЧекКоррекции.ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции);
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - записывает чек коррекции после пробития.
//
Процедура ЗаписатьЧекКоррекцииПослеПробития(ВыходныеПараметры)
	
	ЧекКоррекцииОбъект = ВыходныеПараметры[8].ДокументОснование[0].ПолучитьОбъект();
	
	ЧекКоррекцииОбъект.НомерСмены = ВыходныеПараметры[0];
	
	Если ЗначениеЗаполнено(ВыходныеПараметры[1]) Тогда
		ЧекКоррекцииОбъект.НомерЧекаККМ = ВыходныеПараметры[1];
	КонецЕсли;
	
	ЧекКоррекцииОбъект.ПробитЧек = Истина;
	
	ЧекКоррекцииОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры

&НаСервере
// Процедура обновляет итоги.
//
Процедура ОбновитьИтоги()
	
	СуммаДокумента	= Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаНДС		= Объект.ПозицииЧека.Итог("СуммаНДС");
	СуммаОплаты		= Объект.Оплата.Итог("Сумма");
	
КонецПроцедуры  

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОплатаСуммаПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Выбор".
//
Процедура ТаблицаОснованийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ТаблицаОснований.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПоказатьЗначение(,ТекущиеДанные.ДокументОснование);	 	
	
КонецПроцедуры

&НаСервере
// Заполняет чек коррекции на основании.
//
// Параметры:
//  Основание - ДокументСсылка - документ основание для создания чека коррекции.
//  Отказ - Булево - признак отказа от выполнения операции.
//
Процедура ЗаполнитьНаОсновании(Результат)
		
	ФискальнаяОперация = Результат.ДанныеФискальнойОперации;
	
	Основание = ФискальнаяОперация.ДокументОснование;
	Если ФискальнаяОперация = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Нет сохраненной фискальной операции для документа %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.ДокументОснование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
		Возврат;
		
	ИначеЕсли ФискальнаяОперация.ЕстьКорректирующийДокумент Тогда
		
		ТекстСообщения = НСтр("ru = 'По данному документу ранее была создана корректировка документом %1. 
		|Создание повторной корректировки не возможно.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
		ФискальнаяОперация.ЧекКоррекции);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, ФискальнаяОперация);
	
	Для Каждого ЭлементМ Из ФискальнаяОперация.МассивОснований Цикл
		ЗаполнитьЗначенияСвойств(Объект.ТаблицаОснований.Добавить(), ЭлементМ);
	КонецЦикла;
		
	Объект.Дата								= ТекущаяДатаСеанса();
	Объект.АвторДокумента 					= ОбщегоНазначенияСтоматология.ТекущийПользователь();
	
	РеквизитыКассира	= ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Объект.АвторДокумента, "Сотрудник,Сотрудник.ИНН");
	Объект.Кассир		= РеквизитыКассира.Сотрудник;
	Объект.КассирИНН	= РеквизитыКассира.ИНН;
	
	Объект.ДатаКоррекции 					= ФискальнаяОперация.ДатаРасчета;
	Объект.ДополнительныйРеквизит 			= ФискальнаяОперация.ФискальныйПризнак;
	Объект.ДанныеXMLКорректируемогоЧека		= ФискальнаяОперация.ДанныеXML.Получить();
	Объект.Касса							= ОбщегоНазначенияСтоматология.ПолучитьТекущуюСтруктурнуюЕдиницу().ОсновнаяКасса; // Справочники.Кассы.ПолучитьКассуККМПоУмолчанию(Объект.АвторДокумента);
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеДенежныхСредств") 
		Или ТипЗнч(Основание) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		ВидОперации = Основание.ВидОперации;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Реализация") Тогда
		ВидОперации = Перечисления.ВидыОпераций.Продажа;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		ВидОперации = Перечисления.ВидыОпераций.Возврат;
	КонецЕсли;
	
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(Объект.ДанныеXMLКорректируемогоЧека);
	
	ЗаполнитьЗначенияСвойств(Объект, ОбщиеПараметры, "СистемаНалогообложения, ТипРасчета");
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекКоррекции") Тогда
		Объект.Контрагент		= Основание.Покупатель;
		Объект.КонтрагентИНН	= Основание.ПокупательИНН;
	Иначе
		СписокРеквизитов = "";
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Контрагент", Основание.Метаданные()) Тогда
			СписокРеквизитов = СписокРеквизитов + "Контрагент";
		КонецЕсли;
		Если ОбщегоНазначенияСтоматология.ЕстьРеквизитДокумента("Клиент", Основание.Метаданные()) Тогда
			СписокРеквизитов = СписокРеквизитов + ?(ЗначениеЗаполнено(СписокРеквизитов), ", ", "") + "Клиент";
		КонецЕсли;   	
		
		Объект.Контрагент		= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Основание			, СписокРеквизитов);
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.КонтрагентИНН	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(Объект.Контрагент	, "ИНН");
		КонецЕсли;
	КонецЕсли;
			
	Объект.СНОКорректируемогоДокумента = ОбщиеПараметры.СистемаНалогообложения;
	Объект.ПризнакАгента 			   = ОбщиеПараметры.ПризнакАгента;
	
	Обработки.СозданиеЧековКоррекции.ПолучитьДанныеДляПробитияЧекаККМ(ФискальнаяОперация.ДокументОснование, ОбщиеПараметры);
	ЗаполнитьПозицииЧекаПоОбщимПараметрам(ОбщиеПараметры);
	
	// Оплаты
	Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
		НоваяСтрока = Объект.Оплата.Добавить();   		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОплаты);//,, "ТипОплаты"
		// Если НоваяСтрока.ТипОплаты <> Перечисления.ТипыОплатыККТ.Постоплата Тогда
		//	НоваяСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление;    	
		// КонецЕсли;
	КонецЦикла;
	
	ОбновитьИтоги();
	
КонецПроцедуры

&НаСервере
// Процедура заполняет позиции чека по общим параметрам.
//
Процедура ЗаполнитьПозицииЧекаПоОбщимПараметрам(ОбщиеПараметры)
	
	Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
		
		НоваяСтрока = Объект.ПозицииЧека.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека.ДанныеКодаТоварнойНоменклатуры);
		
		НоваяСтрока.ДанныеПоставщикаИНН 			= ПозицияЧека.ДанныеПоставщика.ИНН;
		НоваяСтрока.ДанныеПоставщикаНаименование 	= ПозицияЧека.ДанныеПоставщика.Наименование;
		НоваяСтрока.ДанныеПоставщикаТелефон 		= ПозицияЧека.ДанныеПоставщика.Телефон;
		
		НоваяСтрока.НаименованиеПредметаРасчета		= ?(ПозицияЧека.Свойство("Номенклатура") И ЗначениеЗаполнено(ПозицияЧека.Номенклатура), 
																						ПозицияЧека.Номенклатура, ПозицияЧека.Наименование);
		НоваяСтрока.СуммаСоСкидками					= ПозицияЧека.Сумма;	
		НоваяСтрока.СтавкаНДС						= Обработки.СозданиеЧековКоррекции.ПолучитьСтавкуНДСПоЗначениюСтавки(ПозицияЧека.СтавкаНДС);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция - проверяет внесены ли изменения в чек коррекции по сравнению с исходным XML.
//
Функция ВнесеныИзменения()
	
	ЕстьИзменения = Ложь;	
	
	ОбъектИсходный = Новый Структура;
	Для Каждого Реквизит Из Метаданные.Обработки.СозданиеЧековКоррекции.Реквизиты Цикл
		ОбъектИсходный.Вставить(Реквизит.Имя);	
	КонецЦикла;
	
	ОбщиеПараметры = МенеджерОборудованияВызовСервера.ЗагрузитьДанныеФискализацииИзXML(Объект.ДанныеXMLКорректируемогоЧека);
	
	ЗаполнитьЗначенияСвойств(ОбъектИсходный, ОбщиеПараметры, "СистемаНалогообложения, ТипРасчета, Кассир, КассирИНН");
			
	ОбъектИсходный.СНОКорректируемогоДокумента = ОбщиеПараметры.СистемаНалогообложения;
	ОбъектИсходный.ПризнакАгента 			   = ОбщиеПараметры.ПризнакАгента;
	
	Если  ОбъектИсходный.СНОКорректируемогоДокумента <> Объект.СистемаНалогообложения Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если Не ЕстьИзменения Тогда
		Обработки.СозданиеЧековКоррекции.ПолучитьДанныеДляПробитияЧекаККМ(ФискальнаяОперация.ДокументОснование, ОбщиеПараметры);
		
		ПозицииЧекаПроверка = Объект.ПозицииЧека.Выгрузить();
		ПозицииЧекаПроверка.Очистить();
		
		ИндексСтроки = 0;
		МассивИменРеквизитов = Новый Массив;
		Для Каждого Реквизит Из Метаданные.Обработки.СозданиеЧековКоррекции.ТабличныеЧасти.ПозицииЧека.Реквизиты Цикл
			МассивИменРеквизитов.Добавить(Реквизит.Имя);	
		КонецЦикла;   
		
		Для Каждого ПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
			
			НоваяСтрока = ПозицииЧекаПроверка.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПозицияЧека.ДанныеКодаТоварнойНоменклатуры);
			
			НоваяСтрока.ДанныеПоставщикаИНН 			= ПозицияЧека.ДанныеПоставщика.ИНН;
			НоваяСтрока.ДанныеПоставщикаНаименование 	= ПозицияЧека.ДанныеПоставщика.Наименование;
			НоваяСтрока.ДанныеПоставщикаТелефон 		= ПозицияЧека.ДанныеПоставщика.Телефон;
			
			НоваяСтрока.НаименованиеПредметаРасчета	= ?(ПозицияЧека.Свойство("Номенклатура") И ЗначениеЗаполнено(ПозицияЧека.Номенклатура), ПозицияЧека.Номенклатура, ПозицияЧека.Наименование);
			НоваяСтрока.СуммаСоСкидками				= ПозицияЧека.Сумма;	
			НоваяСтрока.СтавкаНДС					= Обработки.СозданиеЧековКоррекции.ПолучитьСтавкуНДСПоЗначениюСтавки(ПозицияЧека.СтавкаНДС);
			
			Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
				Если НоваяСтрока[ИмяРеквизита] <> Объект.ПозицииЧека[ИндексСтроки][ИмяРеквизита] Тогда
					ЕстьИзменения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЕстьИзменения Тогда
		
		ИндексСтроки = 0;
		МассивИменРеквизитов = Новый Массив;
		Для Каждого Реквизит Из Метаданные.Обработки.СозданиеЧековКоррекции.ТабличныеЧасти.Оплата.Реквизиты Цикл
			МассивИменРеквизитов.Добавить(Реквизит.Имя);	
		КонецЦикла;  
		
		Для Каждого СтрокаОплаты Из ОбщиеПараметры.ТаблицаОплат Цикл
			
			СтруктураДанныхСтроки = Новый Структура;
			Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
				СтруктураДанныхСтроки.Вставить(ИмяРеквизита);	
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки, СтрокаОплаты);
			
			Для Каждого ИмяРеквизита Из МассивИменРеквизитов Цикл
				Если СтруктураДанныхСтроки[ИмяРеквизита] <> Объект.Оплата[ИндексСтроки][ИмяРеквизита] Тогда
					ЕстьИзменения = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ИндексСтроки = ИндексСтроки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции       

&НаКлиенте
// Процедура - пересчитывает сумму строки.
//
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаСоСкидками = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаСоСкидками;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура АвторДокументаПриИзменении(Элемент)
	
	РеквизитыКассира	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.АвторДокумента, Новый Структура("Сотрудник, ИНН", "Сотрудник", "Сотрудник.ИНН"));
	Объект.Кассир		= РеквизитыКассира.Сотрудник;
	Объект.КассирИНН	= РеквизитыКассира.ИНН;
	
КонецПроцедуры

#КонецОбласти
